# St7GetQuasiStaticRestartFile

Returns the name of the quasi-static restart file.

Solver – General

long St7GetQuasiStaticRestartFile(long uID, char* FileName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

Full path and name for the quasi-static restart file.